Revit 2026 API

# BuiltInFailuresMacroFailures Class

---

Failures about module with duplicate name found during reload latest.

SystemObject Autodesk.Revit.DBBuiltInFailuresMacroFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MacroFailures
```
```vb
Public NotInheritable Class MacroFailures
```
```cpp
public ref class MacroFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MacroFailures = class end
```

The BuiltInFailuresMacroFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DuplicateModuleName | Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed. |

#### Reference

Autodesk.Revit.DB Namespace